tutorials/MicroTGA-DEM_Us_UsInterp/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-0.02 -0.02 -0.02)
    ( 0.02 -0.02 -0.02)
    ( 0.02  0.02 -0.02)
    (-0.02  0.02 -0.02)
    (-0.02 -0.02  0.02)
    ( 0.02 -0.02  0.02)
    ( 0.02  0.02  0.02)
    (-0.02  0.02  0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wallTop
    {
        type wall;
        faces
        (
            (2 3 6 7)
        );
    }


    wallBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }



    wallSides
    {
        type wall;
        faces
        (
            (4 7 3 0)
             (5 1 2 6)
             (0 1 2 3)
             (4 5 6 7)
        );
    }





);

mergePatchPairs
(
);

// ************************************************************************* //
