tutorials/MicroTGA-DEM_Us_UsInterp/0.orig/Df
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (6e+10 0 0 0 6e+10 0 0 0 6e+10);

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
}


// ************************************************************************* //
